MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F417IE/mcu.h
    /** @brief Control register */
    union
    {
        __IOM uint32_t CFG;
        struct
        {
            __IOM uint32_t SLEEP_CLK_STS   : 1;
            __IOM uint32_t STOP_CLK_STS    : 1;
            __IOM uint32_t STANDBY_CLK_STS : 1;
            __IM  uint32_t RESERVED1       : 2;
            __IOM uint32_t TRACE_IOEN      : 1;
            __IOM uint32_t TRACE_MODE      : 2;
            __IM  uint32_t RESERVED2       : 24;
        } CFG_B;
    };

    /** @brief APB1F register */
    union
    {
        __IOM uint32_t APB1F;
        struct
        {
            __IOM uint32_t TMR2_STS                  : 1;
            __IOM uint32_t TMR3_STS                  : 1;
            __IOM uint32_t TMR4_STS                  : 1;
            __IOM uint32_t TMR5_STS                  : 1;
            __IOM uint32_t TMR6_STS                  : 1;
            __IOM uint32_t TMR7_STS                  : 1;
            __IOM uint32_t TMR12_STS                 : 1;
            __IOM uint32_t TMR13_STS                 : 1;
            __IOM uint32_t TMR14_STS                 : 1;
            __IM  uint32_t RESERVED1                 : 1;
            __IOM uint32_t RTC_STS                   : 1;
            __IOM uint32_t WWDT_STS                  : 1;
            __IOM uint32_t IWDT_STS                  : 1;
            __IM  uint32_t RESERVED2                 : 8;
            __IOM uint32_t I2C1_SMBUS_TIMEOUT_STS    : 1;
            __IOM uint32_t I2C2_SMBUS_TIMEOUT_STS    : 1;
            __IOM uint32_t I2C3_SMBUS_TIMEOUT_STS    : 1;
            __IM  uint32_t RESERVED3                 : 1;
            __IOM uint32_t CAN1_STS                  : 1;
            __IOM uint32_t CAN2_STS                  : 1;
            __IM  uint32_t RESERVED4                 : 5;
        } APB1F_B;
    };

    /** @brief APB2F register */
    union
    {
        __IOM uint32_t APB2F;
        struct
        {
            __IOM uint32_t TMR1_STS                  : 1;
            __IOM uint32_t TMR8_STS                  : 1;
            __IM  uint32_t RESERVED1                 : 14;
            __IOM uint32_t TMR9_STS                  : 1;
            __IOM uint32_t TMR10_STS                 : 1;
            __IOM uint32_t TMR11_STS                 : 1;
            __IM  uint32_t RESERVED2                 : 23;
        } APB2F_B;
    };
} DBGMCU_T;

/**
 * @brief Digital camera interface (DCI)
 */
typedef struct
{
    /** @brief DCI control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CEN           : 1;
            __IOM uint32_t CMODE         : 1;
            __IOM uint32_t CROPF         : 1;
            __IOM uint32_t JPGFM         : 1;
            __IOM uint32_t ESYNCSEL      : 1;
            __IOM uint32_t PXCLKPOL      : 1;
            __IOM uint32_t HSYNCPOL      : 1;
            __IOM uint32_t VSYNCPOL      : 1;
            __IOM uint32_t FCRCFG        : 2;
            __IOM uint32_t EXDMOD        : 2;
            __IM  uint32_t RESERVED1     : 2;
            __IOM uint32_t DCIEN         : 1;
            __IM  uint32_t RESERVED2     : 17;
        } CTRL_B;
    } ;

    /** @brief DCI status register*/
    union
    {
        __IM uint32_t STS;

        struct
        {
            __IM uint32_t HSYNCSTS       : 1;
            __IM uint32_t VSYNCSTS       : 1;
            __IM uint32_t FIFONEMP       : 1;
            __IM uint32_t RESERVED       : 29;
        } STS_B;
    };

    /** @brief DCI raw interrupt status register */
    union
    {
        __IM uint32_t RINTSTS;

        struct
        {
            __IM uint32_t CC_RINT           : 1;
            __IM uint32_t OVR_RINT          : 1;
            __IM uint32_t SYNCERR_RINT      : 1;
            __IM uint32_t VSYNC_RINT        : 1;
            __IM uint32_t LINE_RINT         : 1;
            __IM uint32_t RESERVED          : 27;
        } RINTSTS_B;
    };

    /** @brief DCI interrupt enable register */
    union
    {
        __IOM uint32_t INTEN;

        struct
        {
            __IOM uint32_t CCINTEN           : 1;
            __IOM uint32_t OVRINTEN          : 1;
            __IOM uint32_t SYNCERRINTEN      : 1;
            __IOM uint32_t VSYNCINTEN        : 1;
            __IOM uint32_t LINEINTEN         : 1;
            __IM  uint32_t RESERVED          : 22;
        } INTEN_B;
    };

    /** @brief DCI masked interrupt status register */
    union
    {
        __IM uint32_t MINTSTS;

        struct
        {
            __IM uint32_t CC_MINT           : 1;
            __IM uint32_t OVR_MINT          : 1;
            __IM uint32_t SYNCERR_MINT      : 1;
            __IM uint32_t VSYNC_MINT        : 1;
            __IM uint32_t LINE_MINT         : 1;
            __IM uint32_t RESERVED          : 27;
        } MINTSTS_B;
    };

    /** @brief DCI interrupt clear registe */
    union
    {
        __IOM uint32_t INTCLR;

        struct
        {
            __OM uint32_t CC_INTCLR           : 1;
            __OM uint32_t OVR_INTCLR          : 1;
            __OM uint32_t SYNCERR_INTCLR      : 1;
            __OM uint32_t VSYNC_INTCLR        : 1;
            __OM uint32_t LINE_INTCLR         : 1;
            __IM uint32_t RESERVED            : 22;
        } INTCLR_B;
    };

    /** @brief DCI embedded synchronization code register */
    union
    {
        __IOM uint32_t ESYNCC;

        struct
        {
            __IOM uint32_t FSDC           : 8;
            __IOM uint32_t LSDC           : 8;
            __IOM uint32_t LEDC           : 8;
            __IOM uint32_t FEDC           : 8;
        } ESYNCC_B;
    };

    /** @brief DCI embedded synchronization unmask register */
    union
    {
        __IOM uint32_t ESYNCUM;

        struct
        {
            __IOM uint32_t FSDUM           : 8;
            __IOM uint32_t LSDUM           : 8;
            __IOM uint32_t LEDUM           : 8;
            __IOM uint32_t FEDUM           : 8;
        } ESYNCUM_B;
    };

    /** @brief DCI crop window start register */
    union
    {
        __IOM uint32_t CROPWSTAT;

        struct
        {
            __IOM uint32_t HOFSCNT           : 14;
            __IM  uint32_t RESERVED1         : 2;
            __IOM uint32_t VSLINECNT         : 13;
            __IM  uint32_t RESERVED2         : 3;
        } CROPWSTAT_B;
    };

    /** @brief DCI crop window size register */
    union
    {
        __IOM uint32_t CROPWSIZE;

        struct
        {
            __IOM uint32_t CCNT           : 14;
            __IM  uint32_t RESERVED1      : 2;
            __IOM uint32_t VLINECNT       : 14;
            __IM  uint32_t RESERVED2      : 2;
        } CROPWSIZE_B;
    };

    /** @brief DCI data register */
    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IM uint32_t DATA0          : 8;
            __IM uint32_t DATA1          : 8;
            __IM uint32_t DATA2          : 8;
            __IM uint32_t DATA3          : 8;
        } DATA_B;
    };
} DCI_T;

/**
 * @brief System configuration controller (SYSCFG)
 */
typedef struct
{
    union
    {
        __IOM uint32_t MMSEL;

        struct
        {
            __IOM uint32_t MMSEL         : 2;
            __IM  uint32_t RESERVED      : 30;
        } MMSEL_B;
    };
    /** @brief Peripheral Mode Configuration register */
    union
    {
        __IOM uint32_t PMCFG;

        struct
        {
            __IM  uint32_t RESERVED1        : 23;
            __IOM uint32_t ENETSEL          : 1;
            __IM  uint32_t RESERVED2        : 8;
        } PMCFG_B;
    };

    /** @brief External Interrupt Configuration register1 */
    union
    {
        __IOM uint32_t EINTCFG1;

        struct
        {
            __IOM uint32_t EINT0           : 4;
            __IOM uint32_t EINT1           : 4;
            __IOM uint32_t EINT2           : 4;
            __IOM uint32_t EINT3           : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG1_B;
    };

    /** @brief External Interrupt Configuration register2 */
    union
    {
        __IOM uint32_t EINTCFG2;

        struct
        {
            __IOM uint32_t EINT4           : 4;
            __IOM uint32_t EINT5           : 4;
            __IOM uint32_t EINT6           : 4;
            __IOM uint32_t EINT7           : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG2_B;
    };

    /** @brief External Interrupt Configuration register3 */
    union
    {
        __IOM uint32_t EINTCFG3;

        struct
        {
            __IOM uint32_t EINT8           : 4;
            __IOM uint32_t EINT9           : 4;
            __IOM uint32_t EINT10          : 4;
            __IOM uint32_t EINT11          : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG3_B;
    };

    /** @brief External Interrupt Configuration register4 */
    union
    {
        __IOM uint32_t EINTCFG4;

        struct
        {
            __IOM uint32_t EINT12          : 4;
            __IOM uint32_t EINT13          : 4;
            __IOM uint32_t EINT14          : 4;
            __IOM uint32_t EINT15          : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG4_B;
    };

    __IM  uint32_t  RESERVED[2];

    /** @brief Compensation cell control register */
    union
    {
        __IOM uint32_t CCCTRL;

        struct
        {
            __IOM uint32_t CCPD            : 1;
            __IM uint32_t RESERVED1        : 7;
            __IM uint32_t RDYFLG           : 1;
            __IM  uint32_t RESERVED        : 23;
        } CCCTRL_B;
    };
} SYSCFG_T;

/**
 * @brief Ethernet (ETH)
 */
typedef struct
{
    /**
     * @brief ETH_MAC
     */

    /** @brief CFG register */
    union
    {
        __IOM uint32_t CFG;
        struct
        {
            __IM  uint32_t RESERVED1                 : 2;
            __IOM uint32_t RXEN                      : 1;
            __IOM uint32_t TXEN                      : 1;
            __IOM uint32_t DC                        : 1;
            __IOM uint32_t BL                        : 2;
            __IOM uint32_t ACS                       : 1;
            __IM  uint32_t RESERVED2                 : 1;
            __IOM uint32_t DISR                      : 1;
            __IOM uint32_t IPC                       : 1;
            __IOM uint32_t DM                        : 1;
            __IOM uint32_t LBM                       : 1;
            __IOM uint32_t DISRXO                    : 1;
            __IOM uint32_t SSEL                      : 1;
            __IM  uint32_t RESERVED3                 : 1;
            __IOM uint32_t DISCRS                    : 1;
            __IOM uint32_t IFG                       : 3;
            __IM  uint32_t RESERVED4                 : 2;
            __IOM uint32_t JDIS                      : 1;
            __IOM uint32_t WDTDIS                    : 1;
            __IM  uint32_t RESERVED5                 : 1;
            __IOM uint32_t CST                       : 1;
            __IM  uint32_t RESERVED6                 : 6;
        } CFG_B;
    };

    /** @brief FRAF register */
    union
    {
        __IOM uint32_t FRAF;
        struct
        {
            __IOM uint32_t PR                        : 1;
            __IOM uint32_t HUC                       : 1;
            __IOM uint32_t HMC                       : 1;
            __IOM uint32_t DAIF                      : 1;
            __IOM uint32_t PM                        : 1;
            __IOM uint32_t DISBF                     : 1;
            __IOM uint32_t PCTRLF                    : 2;
            __IOM uint32_t SAIF                      : 1;
            __IOM uint32_t SAFEN                     : 1;
            __IOM uint32_t HPF                       : 1;
            __IM  uint32_t RESERVED1                 : 20;
            __IOM uint32_t RXA                       : 1;
        } FRAF_B;
    };

    /** @brief HTH register */
    union
    {
        __IOM uint32_t HTH;
        struct
        {
            __IOM uint32_t HTH                         : 32;
        } HTH_B;
    };

    /** @brief HTL register */
    union
    {
        __IOM uint32_t HTL;
        struct
        {
            __IOM uint32_t HTL                         : 32;
        } HTL_B;
    };

    /** @brief ADDR register */
    union
    {
        __IOM uint32_t ADDR;
        struct
        {
            __IOM uint32_t MB                          : 1;
            __IOM uint32_t MW                          : 1;
            __IOM uint32_t CR                          : 3;
            __IM  uint32_t RESERVED1                   : 1;
            __IOM uint32_t MR                          : 5;
            __IOM uint32_t PA                          : 5;
            __IM  uint32_t RESERVED2                   : 16;
        } ADDR_B;
    };

    /** @brief DATA register */
    union
    {
        __IOM uint32_t DATA;
        struct
        {
            __IOM uint32_t MD                          : 16;
            __IM  uint32_t RESERVED1                   : 16;
        } DATA_B;
    };

    /** @brief FCTRL register */
    union
    {
        __IOM uint32_t FCTRL;
        struct
        {
            __IOM uint32_t FCTRLB                      : 1;
            __IOM uint32_t TXFCTRLEN                   : 1;
            __IOM uint32_t RXFCTRLEN                   : 1;
            __IOM uint32_t UNPFDETE                    : 1;
            __IOM uint32_t PTSEL                       : 2;
            __IM  uint32_t RESERVED1                   : 1;
            __IOM uint32_t ZQPDIS                      : 1;
            __IM  uint32_t RESERVED2                   : 8;
            __IOM uint32_t PT                          : 16;
        } FCTRL_B;
    };

    /** @brief VLANT register */
    union
    {
        __IOM uint32_t VLANT;
        struct
        {
            __IOM uint32_t VLANTID                     : 16;
            __IOM uint32_t VLANTCOMP                   : 1;
            __IM  uint32_t RESERVED                    : 15;
        } VLANT_B;
    };

    __IM  uint32_t  RESERVED0[2];

    /** @brief WKUPFFL register */
    union
    {
        __IOM uint32_t WKUPFFL;
        struct
        {
            __IOM uint32_t FLXBMASK                    : 32;
        } WKUPFFL_B;
    };

    union
    {
        __IOM uint32_t PMTCTRLSTS;
        struct
        {
            __IOM uint32_t PD                          : 1;
            __IOM uint32_t MPEN                        : 1;
            __IOM uint32_t WKUPFEN                     : 1;
            __IM  uint32_t RESERVED1                   : 2;
            __IOM uint32_t MPRX                        : 1;
            __IOM uint32_t WKUPFRX                     : 1;
            __IM  uint32_t RESERVED2                   : 2;
            __IOM uint32_t GUN                         : 1;
            __IM  uint32_t RESERVED3                   : 21;
            __IOM uint32_t WKUPFRST                    : 1;
        } PMTCTRLSTS_B;
    } ;

    __IM  uint32_t  RESERVED1;

    /** @brief DBG register */
    union
    {
        __IM  uint32_t DBG;
        struct
        {
            __IM  uint32_t RPESTS                      : 1;
            __IM  uint32_t RFCFCSTS                    : 2;
            __IM  uint32_t RESERVED1                   : 1;
            __IM  uint32_t RWCSTS                      : 1;
            __IM  uint32_t RRCSTS                      : 2;
            __IM  uint32_t RESERVED2                   : 1;
            __IM  uint32_t RXFSTS                      : 2;
            __IM  uint32_t RESERVED3                   : 6;
            __IM  uint32_t TPESTS                      : 1;
            __IM  uint32_t TFCSTS                      : 2;
            __IM  uint32_t TXPAUSED                    : 1;
            __IM  uint32_t TRCSTS                      : 2;
            __IM  uint32_t TWCSTS                      : 1;
            __IM  uint32_t RESERVED4                   : 1;
            __IM  uint32_t TXFSTS                      : 1;
            __IM  uint32_t TXSTSFSTS                   : 1;
            __IM  uint32_t RESERVED5                   : 6;
        } DBG_B;
    };

